docs/Diagramas/casos-de-uso.md
```mermaid
flowchart LR

Recepcionista --> RegistrarPropietario
Recepcionista --> RegistrarMascota
Recepcionista --> AgendarCita
Recepcionista --> ModificarMascota
Recepcionista --> CancelarCita

Administrador --> VerCitas
Administrador --> EliminarRegistros
```
